Revit 2027 API
ParameterTypeId.StairsRuntypeHasMonolithicSupport Property
 "Monolithic Support": Monolithic Support
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRuntypeHasMonolithicSupport { get; }
Public Shared ReadOnly Property StairsRuntypeHasMonolithicSupport As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRuntypeHasMonolithicSupport {
	ForgeTypeId^ get ();
}
static member StairsRuntypeHasMonolithicSupport : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace